app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user = @current_user
        if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at", "author", "thumbnail") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "kjnkjn"], ["body", "jnkjn"], ["user_id", 36], ["created_at", "2021-12-15 20:36:16.456895"], ["updated_at", "2021-12-15 20:36:16.456895"], ["author", "Johntheman"], ["thumbnail", ""]]

    def update
        if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", ",mjhihi"], ["body", "jkhjjjbiu"], ["updated_at", "2021-12-13 18:45:59.811965"], ["id", 15]]

    def set_user_post
        @post = @current_user.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 2], ["LIMIT", 1]]